tbobd/certification/test7/HotelBookRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
</hot:Credentials>
<wsa:Action>http://TekTravel/HotelBookingApi/HotelBook</wsa:Action>
<wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelBookRequest>
        <hot:ClientReferenceNumber>210314135855789#aaab</hot:ClientReferenceNumber>
        <hot:GuestNationality>AE</hot:GuestNationality>
        <hot:Guests>
            <hot:Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Ajaygety</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>20</hot:Age>
            </hot:Guest>
        </hot:Guests>
        <hot:AddressInfo>
            <hot:AddressLine1>testadd1</hot:AddressLine1>
            <hot:AddressLine2>testadd2</hot:AddressLine2>
            <hot:CountryCode>91</hot:CountryCode>
            <hot:AreaCode>11</hot:AreaCode>
            <hot:PhoneNo>25869696</hot:PhoneNo>
            <hot:Email>abc@gmail.com</hot:Email>
            <hot:City>Delhi</hot:City>
            <hot:State>Delhi</hot:State>
            <hot:Country>India</hot:Country>
            <hot:ZipCode>256525</hot:ZipCode>
        </hot:AddressInfo>
        <!-- VoucherBooking-true Booking will be Vouchered -->
        <hot:PaymentInfo VoucherBooking="true" PaymentModeType="Limit">
        </hot:PaymentInfo>
        <hot:SessionId>8fef13c4-ea3e-4279-a985-0cff0917c718</hot:SessionId>
        <hot:NoOfRooms>1</hot:NoOfRooms>
        <hot:ResultIndex>7</hot:ResultIndex>
        <hot:HotelCode>1180679</hot:HotelCode>
        <hot:HotelName>Crowne Plaza Dubai</hot:HotelName>
        <hot:HotelRooms>
            <hot:HotelRoom>
                <hot:RoomIndex>1</hot:RoomIndex>
                <hot:RoomTypeName>Superior Deluxe King Bed Smoking</hot:RoomTypeName>
                <hot:RoomTypeCode>KDXSIKB20|1^^KDXSIKB20IKB20</hot:RoomTypeCode>
                <hot:RatePlanCode>KDXSIKB20IKB20</hot:RatePlanCode>
                <hot:RoomRate RoomFare="285.15" Currency="USD" AgentMarkUp="0.00" RoomTax="32.40" TotalFare="317.56"/>
            </hot:HotelRoom>
        </hot:HotelRooms>
    </hot:HotelBookRequest>
</soap:Body>
</soap:Envelope>